In [1]:
import pandas as pd

In [2]:
list_var = ['a','b','c','d']

In [3]:
type(list_var)

list

In [4]:
series_var = pd.Series(list_var, index = [1, 2, 3, 4])

In [5]:
series_var

1    a
2    b
3    c
4    d
dtype: object

In [6]:
type(series_var)

pandas.core.series.Series

In [7]:
series_var2 = pd.Series({1:'a', 2:'b', 3:'c', 4:'d'})

In [8]:
series_var2

1    a
2    b
3    c
4    d
dtype: object

In [9]:
series_var2[1]

'a'

## DataFrame

- DataFrame = Series + Series + Series + Series + ....

In [10]:
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['F', 'F', 'M']})

In [11]:
df

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [12]:
df['name']

0        yejin
1        jiwon
2    sanghyeon
Name: name, dtype: object

In [13]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [15]:
df.head() #.head 위에서 부터 5개를 불러온다.

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [16]:
df.tail() #.tail 아래에서 부터 5개를 불러온다.

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [17]:
import pandas as pd

In [18]:
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['1', '1', '0']})

In [19]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [20]:
df['age'].astype(int)

0    25
1    22
2    32
Name: age, dtype: int32

In [21]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [22]:
df['age'] = df['age'].astype(int)

In [23]:
df['age']

0    25
1    22
2    32
Name: age, dtype: int32

In [24]:
print(df['age'].sum()) # 합
print(df['age'].mean()) # 평균
print(df['age'].median()) # 중앙값
print(df['age'].max()) # 최대
print(df['age'].min()) # 최소
print(df['age'].var())# 분산
print(df['age'].std()) # 표준편차

79
26.333333333333332
25.0
32
22
26.333333333333332
5.131601439446884

In [25]:
df.describe()

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [26]:
df[(df['age'] > 20) & (df['gender'] == '1')]

    name  age gender
0  yejin   25      1
1  jiwon   22      1

In [27]:
df[(df['age'] > 20) | (df['gender'] == '1')]

        name  age gender
0      yejin   25      1
1      jiwon   22      1
2  sanghyeon   32      0

### loc(index기반), iloc(위치 또는 순서 기반)

In [28]:
#loc(index기반)
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['1', '1', '0']}, index=['a','b','c'])

In [29]:
df.loc['a']

name      yejin
age          25
gender        1
Name: a, dtype: object

In [30]:
df.iloc[0]

name      yejin
age          25
gender        1
Name: a, dtype: object

In [31]:
df.iloc[0]['age']

'25'

In [32]:
df.iloc[0].age

'25'

In [33]:
df.iloc[0]['name']

'yejin'

In [34]:
df.iloc[0].name

'a'

## DataFrame 합치기

In [35]:
import pandas as pd

In [36]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                    'C':[9,10,11,12]})
df2= pd.DataFrame({'A':[13,14,15,16],
                   'B':[17,18,19,20],
                   'C':[21,22,23,24]})

In [37]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [38]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [39]:
df3 = pd.concat([df1, df2])

In [40]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [41]:
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [42]:
df3.reset_index(drop=True)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [43]:
df3 = df3.reset_index(drop=True)

In [44]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [45]:
pd.concat([df1, df2], axis=1) #axis=1(열), axis=0(행)

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [46]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [47]:
df1['D'] = [13,14,15,16]

In [48]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [49]:
df1.drop('A', axis=1)

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [50]:
df1.drop('A', axis=1)

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [51]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [52]:
df1.drop('A', axis=1, inplace=True) #=  df1 = df1.drop('A', axis=1)

In [53]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

## Groupby

In [54]:
import pandas as pd

In [55]:
data = { 'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
        'Sales':[200, 120, 340, 124, 243, 350]}

In [56]:
df = pd.DataFrame(data)

In [57]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [58]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [59]:
#회사별 세일즈 값의 평균 (내가해본것)
data.groupby(['Company', 'Sales'].as_index=False).mean()

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (3879989079.py, line 2)

In [ ]:
#회사별 세일즈 값의 평균
len(df[df['Company'] & df['Sales'].mean()])

In [ ]:
df

In [ ]:
print(df[df['Company'] == 'GOOG']['Sales'].mean())
print(df[df['Company'] == 'MSFT']['Sales'].mean())
print(df[df['Company'] == 'FB']['Sales'].mean())

In [ ]:
df.groupby('Company')

In [ ]:
df.groupby('Company')['Sales'].mean()

In [ ]:
df.groupby('Company').min()

In [ ]:
df.groupby(['Company', 'Person']).min()

In [ ]:
df.groupby('Company').count()

In [ ]:
df.groupby('Company').describe()

In [ ]:
df = pd.DataFrame({'수학점수':[65,80,60,80],
                   '과학점수':[50,75,60,80],
                   '내신등급':[3, 1, 2, 1]})

In [ ]:
df

In [ ]:
df.columns

In [ ]:
df.sort_values(by='수학점수')

In [ ]:
df.sort_values(by='수학점수', ascending=False) #ascending(오름차순),descending(내림차순)

In [ ]:
df.sort_values(by=['수학점수', '과학점수'], ascending=[True,False])

xls xlsx (엑셀 프로그램으로만 열 수 있음)

csv (모든 프로그램으로 파일을 열 수 있음)

In [ ]:
#어제 해커톤에서 사용했던 데이터로 수업진행

In [60]:
import pandas as pd

In [61]:
df = pd.read_csv('HR-Employee-Attrition.csv')

In [ ]:
df.head()

In [ ]:
df.shape #행렬(1470개의 data, 35개의 columns)

In [ ]:
df['Gender'].unique()

In [ ]:
df.isnull().sum()

In [ ]:
df['Gender']

In [ ]:
df['Gender'].unique()

In [ ]:
df['Gender'].value_counts()

In [ ]:
gender_mapping = {'Female':0, 'Male':1}

In [ ]:
df['Gender'].map(gender_mapping)

In [ ]:
df['Gender'] = df['Gender'].map(gender_mapping)

In [ ]:
df['Gender'].value_counts()

In [ ]:
df['Gender2'] = df['Gender'].map(gender_mapping)

In [ ]:
df['Gender2'].value_counts()

In [ ]:
#df['BusinessTravel']를 df['Gender'] 문제 푼 것처럼 혼자 풀어봄.
df['BusinessTravel'].unique()

In [ ]:
df['BusinessTravel'].value_counts()

In [ ]:
bt_mapping = {'Travel_Rarely':0, 'Travel_Frequently':1, 'Non-Travel':2}

In [ ]:
df['BusinessTravel'].map(bt_mapping)

In [ ]:
df['BusinessTravel2'] = df['BusinessTravel'].map(bt_mapping)

In [ ]:
df['BusinessTravel'].value_counts()

In [ ]:
df['BusinessTravel2'].value_counts()

bt_mapping = {'Travel_Rarely':0, 'Travel_Frequently':1}

df['BusinessTravel'].map(bt_mapping)

df['BusinessTravel'] = df['BusinessTravel'].map(bt_mapping)

df['BusinessTravel'].value_counts()

In [ ]:
#for문을 활용하여 df['BusinessTravel']를 구해보자.
bt_mapping = {}
for i, j in enumerate(['Travel_Rarely', 'Travel_Frequently', 'Non-Travel']) :
    print(i, j)

In [ ]:
#1-1)for문을 활용하여 df['BusinessTravel']를 구해보자. (강사님 버젼)
bt_mapping = {}
for value, key in enumerate(df['BusinessTravel'].unique()) :
    bt_mapping[key] = value

In [ ]:
bt_mapping

In [ ]:
#1-2)for문을 활용하여 df['BusinessTravel']를 구해보자.(승현버전)
bt_mapping = {}

for i, j in enumerate(df['BusinessTravel'].unique()) :
    bt_mapping[j] = i
    
print(bt_mapping)

In [ ]:
df['BusinessTravel'].value_counts()

In [ ]:
df['BusinessTravel2'] = df['BusinessTravel'].value_counts()

In [ ]:
df['BusinessTravel2'].value_counts()

In [ ]:
df['Department'].unique()

for col in catColumns :
    print(col, df[col].unique())
    print('-----')

for col in catColumns :
    print(col, df[col].value_counts())
    print('-----')

In [ ]:
numColumns = df.select_

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [65]:
intcolumns = df.select_dtypes('int64').columns

In [66]:
df[intcolumns]

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1102,1,2,1,1,2,94,3,2,...,1,80,0,8,0,1,6,4,0,5
1,49,279,8,1,1,2,3,61,2,2,...,4,80,1,10,3,3,10,7,1,7
2,37,1373,2,2,1,4,4,92,2,1,...,2,80,0,7,3,3,0,0,0,0
3,33,1392,3,4,1,5,4,56,3,1,...,3,80,0,8,3,3,8,7,3,0
4,27,591,2,1,1,7,1,40,3,1,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,884,23,2,1,2061,3,41,4,2,...,3,80,1,17,3,3,5,2,0,3
1466,39,613,6,1,1,2062,4,42,2,3,...,1,80,1,9,5,3,7,7,1,7
1467,27,155,4,3,1,2064,2,87,4,2,...,2,80,1,6,0,3,6,2,0,3
1468,49,1023,2,3,1,2065,4,63,2,2,...,4,80,0,17,3,2,9,6,0,8
1469,34,628,8,3,1,2068,2,82,4,2,...,1,80,0,6,3,4,4,3,1,2

In [ ]:
intcolumns

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('HR-Employee-Attrition.csv')

In [67]:
#여기서부터 실행해보기
X = df[intcolumns]

In [69]:
att_map = {}
for value,key in enumerate(df['Attrition'].unique()) :
    att_map[key] = value

In [70]:
df['Attrition'] = df['Attrition'].map(att_map)

In [71]:
Y = df['Attrition']

In [72]:
print(X.shape, Y.shape)

(1470, 26) (1470,)

In [73]:
X.columns

Index(['Age', 'DailyRate', 'DistanceFromHome', 'Education', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobSatisfaction', 'MonthlyIncome',
       'MonthlyRate', 'NumCompaniesWorked', 'PercentSalaryHike',
       'PerformanceRating', 'RelationshipSatisfaction', 'StandardHours',
       'StockOptionLevel', 'TotalWorkingYears', 'TrainingTimesLastYear',
       'WorkLifeBalance', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'],
      dtype='object')

In [74]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [84]:
train_input, test_input, train_output, test_output = train_test_split(X, Y, test_size=0.2, stratify=Y, random_state=0) #X는 문제지, Y는 정답지, stratify=Y는 Y인 정답지를 가지고 비율을 맞추어 줘라, random_state=0은 seed 값과 비슷한 역할을 한다.

In [77]:
print(train_input.shape)
print(train_output.shape)
print(train_input.shape)
print(train_output.shape)

(1176, 26)
(1176,)
(1176, 26)
(1176,)

In [78]:
classifier1 = DecisionTreeClassifier()

In [79]:
classifier2 = RandomForestClassifier()

In [ ]:
#classifier1 = DecisionTreeClassifier()에 대해 풀어봄

In [80]:
classifier1.fit(train_input, train_output)

DecisionTreeClassifier()

In [81]:
predict_train = classifier1.predict(train_input)

In [ ]:
train_input

In [ ]:
predict_train

In [95]:
train_output.value_counts()

1    986
0    190
Name: Attrition, dtype: int64

In [82]:
accuracy_score(predict_train, train_output) * 100

100.0

In [85]:
predict_test = classifier1.predict(test_input) #예측

In [86]:
accuracy_score(predict_test, test_output) * 100

73.80952380952381

In [ ]:
# classifier2 = RandomForestClassifier()에 대해 풀어보자.

In [87]:
classifier2.fit(train_input, train_output)

RandomForestClassifier()

In [88]:
predict_train = classifier2.predict(train_input)

In [89]:
train_input

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
1342,34,1480,4,3,1,1882,3,64,3,3,...,4,80,3,9,3,3,5,3,1,0
106,50,1115,1,3,1,141,1,73,3,5,...,1,80,0,28,1,2,8,3,0,7
28,44,477,7,4,1,36,1,42,2,3,...,4,80,1,24,4,3,22,6,5,17
845,40,902,26,2,1,1180,3,92,2,2,...,4,80,1,16,3,1,1,1,0,0
182,41,1356,20,2,1,248,2,70,3,1,...,4,80,0,4,5,2,4,3,0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
302,28,1476,16,2,1,412,2,68,4,2,...,3,80,0,9,2,3,8,3,0,7
740,35,802,10,3,1,1028,2,45,3,1,...,1,80,1,3,4,2,3,2,1,2
713,45,974,1,4,1,996,4,91,3,1,...,4,80,2,8,2,3,5,3,0,2
285,37,1372,1,3,1,391,4,42,3,1,...,2,80,0,17,3,3,17,12,5,7
1361,26,1096,6,3,1,1918,3,61,4,1,...,1,80,1,8,3,3,7,7,7,7

In [90]:
predict_train

array([1, 1, 1, ..., 1, 1, 1], dtype=int64)

In [91]:
train_output.value_counts()

1    986
0    190
Name: Attrition, dtype: int64

In [92]:
accuracy_score(predict_train, train_output) * 100 #예측

100.0

In [93]:
predict_test = classifier2.predict(test_input)

In [94]:
accuracy_score(predict_test, test_output) * 100

85.37414965986395